app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `admin`) VALUES ('admin2', 'admin2@hoge.com', '$2a$12$5K5HVuhm/F5pKvhmoVTmwu8M1oUJHQVw5/RLdacDzNKAoVaDH4bQO', '2020-04-15 13:36:58', '2020-04-15 13:36:58', TRUE)

  def destroy
    @user = User.find(params[:id])
    @user.destroy!
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1