app/views/tasks/destroy.js.erb

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `tasks` WHERE `tasks`.`user_id` = 1
---
var message = document.createElement('p');
message.innerText = 'タスク「<%= @task.name %>を削除しました。残りのタスクは<%= current_user.tasks.count %>件です。';