app/controllers/sessions_controller.rb

  def create
    # 送信されたメアドでユーザーを探す
    user = User.find_by(email: session_params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'admin@hoge.com' LIMIT 1