app/controllers/tasks_controller.rb

INSERT INTO `tasks` (`name`, `description`, `created_at`, `updated_at`) VALUES ('hoge', 'hogehoge', '2020-04-13 14:37:19', '2020-04-13 14:37:19')
---
  def create
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save

UPDATE `tasks` SET `updated_at` = '2020-04-21 07:16:33' WHERE `tasks`.`id` = 6
---
  def update
    @task.update!(task_params)

DELETE FROM `tasks` WHERE `tasks`.`id` = 1
---
  def destroy
    @task.destroy!

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 1 LIMIT 1
---
  def set_task
    @task = current_user.tasks.find(params[:id])