app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT  DISTINCT `tasks`.`id` AS count_column FROM `tasks` WHERE `tasks`.`user_id` = 1 LIMIT 25 OFFSET 0) subquery_for_count
SELECT DISTINCT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`created_at` >= '2020-04-18 15:00:00' ORDER BY `tasks`.`created_at` DESC

  def create
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save
---
INSERT INTO `tasks` (`name`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('あああ', '', '2020-04-21 10:16:49', '2020-04-21 10:16:49', 1)

  def update
    @task.update!(task_params)
---
UPDATE `tasks` SET `updated_at` = '2020-04-21 07:16:56' WHERE `tasks`.`id` = 6

  def destroy
    @task.destroy!
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 1

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 1 LIMIT 1