app/models/task.rb

INSERT INTO `tasks` (`name`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('餃子を作る', '160個作る', '2020-04-21 08:32:41', '2020-04-21 08:32:41', 1)
---
      task = new
      task.attributes = row.to_hash.slice(*csv_attributes)
      task.save!